export const EVENT_HASH = "23FA307410B1F9BE84842D1ABE30D6AB48EA2CF8";

export const MAIN_FETCH_TIMEOUT_MS = 10000;

export const MAX_REFETCH_INTERVAL_MS = 500;

export const MARGIN_PROPORTION = 0.2; // 20% Profit Margin

export const FAKE_FIOS_USE = false;
export const FAKE_FIO_GENDER = "male"; // "male" or "female"
export const REAL_FIO = "John Doe";
export const REAL_PHONE = "+79313636363";
export const REAL_EMAIL = "example@gmail.com";

export const BOOKING_MATCHER = {
    Взрослый: 2,
};

// Both times in hh:mm format
export const BOOKING_MIN_TIME = "18:59";
export const BOOKING_MAX_TIME = "21:00";

export const BOOKING_MIN_DATE = "2025-07-26";
export const BOOKING_MAX_DATE = "2025-08-01";

export const AUTH_COOKIE_NAME = "LAKHTA_CENTRE_ONLINE_TICKETS";

export const AUTH_COOKIE = ``;

export const XSRF_TOKEN_REFRESH_INTERVAL_MS = 30000;

export const EMAIL_GENERATOR = () => {
    return REAL_EMAIL.split("@")[0] + "+" + new Date().getTime() + "@gmail.com";
};

export const FAKE_PHONE_GENERATOR = () => {
    return `+7921${Math.floor(Math.random() * 10000000)
        .toString()
        .padStart(7, "0")}`;
};

export const FAKE_FIOS_MALE = [
    [
        "Иванов",
        "Сидоров",
        "Кузнецов",
        "Попов",
        "Васильев",
        "Соколов",
        "Яковлев",
        "Поляков",
        "Степанов",
        "Михайлов",
        "Федоров",
        "Николаев",
        "Крылов",
        "Кузьмин",
        "Ковалев",
        "Ильин",
        "Григорьев",
        "Козлов",
        "Сергеев",
        "Павлов",
        "Морозов",
        "Зайцев",
        "Лебедев",
        "Беляев",
        "Гаврилов",
    ],
    [
        "Иван",
        "Сергей",
        "Дмитрий",
        "Алексей",
        "Александр",
        "Максим",
        "Андрей",
        "Денис",
        "Евгений",
        "Игорь",
        "Кирилл",
        "Михаил",
        "Николай",
        "Олег",
        "Павел",
        "Роман",
        "Владимир",
        "Артем",
        "Юрий",
        "Виктор",
        "Глеб",
        "Константин",
        "Вячеслав",
        "Антон",
        "Илья",
    ],
    [
        "Иванович",
        "Петрович",
        "Попович",
        "Васильевич",
        "Яковлевич",
        "Степанович",
        "Михайлович",
        "Федорович",
        "Николаевич",
        "Александрович",
        "Сергеевич",
        "Дмитриевич",
        "Алексеевич",
        "Владимирович",
        "Олегович",
        "Павлович",
        "Романович",
        "Константинович",
        "Юрьевич",
        "Викторович",
    ],
];

export const FAKE_FIOS_FEMALE = [
    [
        "Иванова",
        "Сидорова",
        "Кузнецова",
        "Попова",
        "Васильева",
        "Соколова",
        "Яковлева",
        "Полякова",
        "Степанова",
        "Михайлова",
        "Федорова",
        "Николаева",
        "Крылова",
        "Кузьмина",
        "Ковалева",
        "Ильина",
        "Григорьева",
        "Козлова",
        "Сергеева",
        "Павлова",
        "Морозова",
        "Зайцева",
        "Лебедева",
        "Беляева",
        "Гаврилова",
    ],
    [
        "Анна",
        "Екатерина",
        "Мария",
        "Елена",
        "Ольга",
        "Наталья",
        "Ирина",
        "Светлана",
        "Татьяна",
        "Юлия",
        "Анастасия",
        "Ксения",
        "Виктория",
        "Дарья",
        "Алина",
        "София",
        "Елизавета",
        "Полина",
        "Валерия",
        "Маргарита",
        "Вероника",
        "Оксана",
        "Людмила",
        "Галина",
        "Надежда",
    ],
    [
        "Ивановна",
        "Петровна",
        "Поповна",
        "Васильевна",
        "Яковлевна",
        "Степановна",
        "Михайловна",
        "Федоровна",
        "Николаевна",
        "Александровна",
        "Сергеевна",
        "Дмитриевна",
        "Алексеевна",
        "Владимировна",
        "Олеговна",
        "Павловна",
        "Романовна",
        "Константиновна",
        "Юрьевна",
        "Викторовна",
    ],
];
